{
    "_name_or_path": "distilbert-base-uncased",
    "activation": "gelu",
    "architectures": [
      "DistilBertForTokenClassification"
    ],
    "attention_dropout": 0.1,
    "dim": 768,
    "dropout": 0.1,
    "hidden_dim": 3072,
    "id2label": {
      "0": "O",
      "1": "B-Amenity",
      "2": "I-Amenity",
      "3": "B-Rating",
      "4": "I-Rating",
      "5": "B-Hours",
      "6": "I-Hours",
      "7": "B-Dish",
      "8": "I-Dish",
      "9": "B-Restaurant_Name",
      "10": "I-Restaurant_Name",
      "11": "B-Cuisine",
      "12": "I-Cuisine",
      "13": "B-Location",
      "14": "I-Location",
      "15": "B-Price",
      "16": "I-Price"
    },
    "initializer_range": 0.02,
    "label2id": {
      "B-Amenity": 1,
      "B-Cuisine": 11,
      "B-Dish": 7,
      "B-Hours": 5,
      "B-Location": 13,
      "B-Price": 15,
      "B-Rating": 3,
      "B-Restaurant_Name": 9,
      "I-Amenity": 2,
      "I-Cuisine": 12,
      "I-Dish": 8,
      "I-Hours": 6,
      "I-Location": 14,
      "I-Price": 16,
      "I-Rating": 4,
      "I-Restaurant_Name": 10,
      "O": 0
    },
    "max_position_embeddings": 512,
    "model_type": "distilbert",
    "n_heads": 12,
    "n_layers": 6,
    "pad_token_id": 0,
    "qa_dropout": 0.1,
    "seq_classif_dropout": 0.2,
    "sinusoidal_pos_embds": false,
    "tie_weights_": true,
    "torch_dtype": "float32",
    "transformers_version": "4.47.0",
    "vocab_size": 30522
  }
  